Revit 2026 API
InsulationTypeSetIterator Constructor
For Internal Use Only.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public InsulationTypeSetIterator()
Public Sub New
public:
InsulationTypeSetIterator()
new : unit -> InsulationTypeSetIterator
Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
See Also
Reference
InsulationTypeSetIterator Class
Autodesk.Revit.DB.Electrical Namespace